# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh-syntax-highlighting'

# Install Binaries
brew 'mas'
brew 'node'

# Development
cask 'dotnet-sdk'
cask 'imageoptim'
cask 'sourcetree'
cask 'sublime-text'
cask 'visual-studio-code'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'dropbox'
cask 'google-chrome'
cask 'iTerm2'
cask 'karabiner-elements'
cask 'kdiff3'
cask 'p4merge'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'spotmenu'
cask 'transmission'
cask 'transmit'
cask 'the-unarchiver'
cask 'thyme'
cask 'vlc'
cask 'vnc-viewer'
cask 'zeplin'

# Quicklook
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklookapk'
cask 'quicklook-json'
cask 'provisioning'

# Install Mac App Store apps
mas 'Battery Health', id: 490192174
mas 'DevCleaner', id: 1388020431
mas 'GIPHY CAPTURE', id: 668208984
mas 'Microsoft OneNote', id: 784801555
mas 'OneDrive', id: 823766827
mas 'Sip', id: 507257563
mas 'Snap', id: 418073146
mas 'Skitch', id: 425955336
mas 'Trello', id: 1278508951
mas 'TweetDeck', id: 485812721